// Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. 
// Выполнить с помощью рекурсии.
/*
void ShowNumbers (int n)
{
    if(n >= 1)
    {
        Console.Write(n + " ");
        if(n > 1) ShowNumbers(n - 1);
    }
}
ShowNumbers(5);
*/

// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.

